package ru.tetra.telnetclient.utils.parser.enums;

/**
 * Create by graf-anton on 23.12.2020
 *
 * SNMP-OID компонентов системы Янтарь-T IP
 */
public enum TetraOid {

    //================ Общие OID'ы ================================
    //Время работы компонента
    COMPONENT_UPTIME_OID("1.3.6.1.4.1.2654.2.1.13.0"),

    //SNMP OID для получения данных о производительность компонента
    PERFORMANCES_NUMBER_OID("1.3.6.1.4.1.2654.2.5.1.0"),
    PERFORMANCE_INDEX_OID("1.3.6.1.4.1.2654.2.5.3.1.1"),
    PERFORMANCE_ID_OID("1.3.6.1.4.1.2654.2.5.3.1.2"),
    PERFORMANCE_NAME_OID("1.3.6.1.4.1.2654.2.5.3.1.3"),
    PERFORMANCE_CUR_VALUE_OID("1.3.6.1.4.1.2654.2.5.3.1.4"),
    PERFORMANCE_MIN_VALUE_OID("1.3.6.1.4.1.2654.2.5.3.1.5"),
    PERFORMANCE_MAX_VALUE_OID("1.3.6.1.4.1.2654.2.5.3.1.6"),
    PERFORMANCE_AVG_VALUE_OID("1.3.6.1.4.1.2654.2.5.3.1.7"),

    //SNMP OID для получения данных об авариях компонента
    ALARMS_NUMBER_OID("1.3.6.1.4.1.2654.2.6.1.0"),
    ALARM_INDEX_OID("1.3.6.1.4.1.2654.2.6.2.1.1"),
    ALARM_ID_OID("1.3.6.1.4.1.2654.2.6.2.1.2"),
    ALARM_NAME_OID("1.3.6.1.4.1.2654.2.6.2.1.3"),
    ALARM_STATUS_OID("1.3.6.1.4.1.2654.2.6.2.1.4"),
    ALARM_STATUS_TIME_OID("1.3.6.1.4.1.2654.2.6.2.1.5"),

    //================ OID'ы PUC ================================
    //Количество видимых спутников GPS
    PUC_GPS_NUMBER_OID("1.3.6.1.4.1.2654.3.2.13.10.2.12.1.0"),
    //КСВ на антенном разъеме
    PUC_BRAC_VSWR_OID("1.3.6.1.4.1.2654.3.2.13.5.2.1.3.1.11.1"),
    //КСВ несущая
    PUC_CAR_VSWR_OID("1.3.6.1.4.1.2654.3.2.13.8.2.2.1.1.15."),
    //Мощность отраженная на антенном разъеме
    PUC_BRAC_REFLECT_POWER_OID("1.3.6.1.4.1.2654.3.2.13.5.2.1.3.1.10.1"),
    //Мощность передаваемая на антенный разъем
    PUC_BRAC_FORWARD_POWER_OID("1.3.6.1.4.1.2654.3.2.13.5.2.1.3.1.9.1"),
    //Мощность передаваемая несущая 1
    PUC_CAR_FORWARD_POWER_OID("1.3.6.1.4.1.2654.3.2.13.8.2.2.1.1.13."),
    //Температура сумматоа
    PUC_BRAC_TEMPERATURE_OID("1.3.6.1.4.1.2654.3.2.13.5.2.1.3.1.12.1"),
    //Температура несущей
    PUC_CAR_TEMPERATURE_OID("1.3.6.1.4.1.2654.3.2.13.8.2.2.1.1.16."),
    //Уровень помех на несущей
    PUC_CAR_JAMMING_OID("1.3.6.1.4.1.2654.2.5.3.1.6."),
    //Частота RX несущей
    PUC_CAR_RX_FRQ_OID("1.3.6.1.4.1.2654.3.2.13.8.1.4.1.1.4."),
    //Частота TX несущей
    PUC_CAR_TX_FRQ_OID("1.3.6.1.4.1.2654.3.2.13.8.1.4.1.1.3."),

    //================ ОOID'ы TOS ================================
    //Location Area
    TOS_LA_OID("1.3.6.1.4.1.2654.3.2.4.11.1.1.1.1.19.1"),
    //Код страны MCC
    TOS_MCC_OID("1.3.6.1.4.1.2654.3.2.4.11.1.1.1.1.62.1"),
    //Код страны MNC
    TOS_MNC_OID("1.3.6.1.4.1.2654.3.2.4.11.1.1.1.1.63.1"),
    //Загрузка MCCH DL
    TOS_MCCH_DL_OID("1.3.6.1.4.1.2654.2.5.3.1.6.8"),
    //Загрузка MCCH UL
    TOS_MCCH_UL_OID("1.3.6.1.4.1.2654.2.5.3.1.6.9"),
    //Количество запросов в очереди
    TOS_QUEN_COUNT_OID("1.3.6.1.4.1.2654.2.5.3.1.6.7"),
    //Количество свободных каналов
    TOS_FREE_CHANNELS_COUNT_OID("1.3.6.1.4.1.2654.2.5.3.1.5.5"),
    //Количество трафиковых каналов
    TOS_TRAFFIC_CHANNELS_COUNT_OID("1.3.6.1.4.1.2654.2.5.3.1.6.4"),
    //Номер файла NDB
    TOS_NDB_FILE_NUMBER_OID("1.3.6.1.4.1.2654.3.2.4.16.3.1.1.0"),

    //================ OID'ы HWG ================================
    //Модель процессора
    HWG_CPU_MODEL_OID("1.3.6.1.4.1.2654.3.1.6.4.5.3.1.1.1.2.1"),
    //Доступное ОЗУ
    HWG_RAM_FREE_OID("1.3.6.1.4.1.2654.3.1.6.4.5.3.2.3.0"),
    //Загрузка процессора
    HWG_CPU_BUSY_OID("1.3.6.1.4.1.2654.3.1.6.4.5.3.1.1.1.4.1"),
    //Используемое ОЗУ
    HWG_RAM_BUSY_OID("1.3.6.1.4.1.2654.3.1.6.4.5.3.2.2.0"),
    //Объем ОЗУ
    HWG_RAM_TOTAL_OID("1.3.6.1.4.1.2654.3.1.6.4.5.3.2.4.0"),
    //Размер раздела
    HWG_HDD_TOTAL_OID("1.3.6.1.4.1.2654.3.1.6.4.5.2.5.1.1.6."),
    //Используемое место раздела
    HWG_HDD_BUSY_OID("1.3.6.1.4.1.2654.3.1.6.4.5.2.5.1.1.5."),
    //Свободное место раздела
    HWG_HDD_FREE_OID("1.3.6.1.4.1.2654.3.1.6.4.5.2.5.1.1.4."),
    //Имя раздела
    HWG_HDD_NAME_OID("1.3.6.1.4.1.2654.3.1.6.4.5.2.5.1.1.2."),
    //Точка монтирования
    HWG_HDD_MOUNT_OID("1.3.6.1.4.1.2654.3.1.6.4.5.2.5.1.1.3."),
    //Температура процессора
    HWG_CPU_TEMPERATURE_OID("1.3.6.1.4.1.2654.3.1.6.4.5.2.4.1.1.3.1"),
    //Температура материнской платы
    HWG_MB_TEMPERATURE_OID("1.3.6.1.4.1.2654.3.1.6.4.5.2.4.1.1.3.2"),

    //================ OID'ы COS ================================
    //Время в очереди групповые вызовы
    COS_GROUP_QUEN_TIME_OID("1.3.6.1.4.1.2654.2.5.3.1.7.11"),
    //Время в очереди индивидуальные вызовы
    COS_INDIV_QUEN_TIME_OID("1.3.6.1.4.1.2654.2.5.3.1.7.3"),
    //Доставленные групповые SDS
    COS_GROUP_DELIVERED_SDS_OID("1.3.6.1.4.1.2654.2.5.3.1.7.18"),
    //Доставленные индивидуальные SDS
    COS_INDIV_DELIVERED_SDS_OID("1.3.6.1.4.1.2654.2.5.3.1.7.17"),
    //Имя сети
    COS_NETWORK_NAME_OID("1.3.6.1.4.1.2654.2.1.15.1.0"),
    //Недоступные групповые вызовы
    COS_GROUP_UNREACH_CALL_OID("1.3.6.1.4.1.2654.2.5.3.1.7.10"),
    //Недоступные групповые вызовы
    COS_INDIV_UNREACH_CALL_OID("1.3.6.1.4.1.2654.2.5.3.1.7.2"),
    //Недоступные индивидуальные SDS
    COS_INDIV_UNREACH_SDS_OID("1.3.6.1.4.1.2654.2.5.3.1.7.16"),
    //Количество очередей групповые вызовы
    COS_GROUP_QUEN_OID("1.3.6.1.4.1.2654.2.5.3.1.7.13"),
    //Количество очередей индивидуальные вызовы
    COS_INDIV_QUEN_OID("1.3.6.1.4.1.2654.2.5.3.1.7.15"),
    //Сброшенные групповые вызовы
    COS_GROUP_RESET_CALL_OID("1.3.6.1.4.1.2654.2.5.3.1.7.9"),
    //Сброшенные индивидуальные вызовы
    COS_INDIV_RESET_CALL_OID("1.3.6.1.4.1.2654.2.5.3.1.7.1"),
    //Удачные групповые вызовы
    COS_GROUP_SUCCESS_CALL_OID("1.3.6.1.4.1.2654.2.5.3.1.7.14"),
    //Удачные индивидуальные вызовы
    COS_INDIV_SUCCESS_CALL_OID("1.3.6.1.4.1.2654.2.5.3.1.7.6"),
    //Установленные handover индивидуальных вызовов
    COS_INDIV_HANDOVER_OID("1.3.6.1.4.1.2654.2.5.3.1.7.8"),
    //Установленные групповые вызовы
    COS_GROUP_INITIAL_CALL_OID("1.3.6.1.4.1.2654.2.5.3.1.7.12"),
    //Установленные индивидуальные вызовы
    COS_INDIV_INITIAL_CALL_OID("1.3.6.1.4.1.2654.2.5.3.1.7.4"),
    //Установленные экстренные групповые вызовы
    COS_GROUP_INITIAL_EMERGENCY_CALL_OID("1.3.6.1.4.1.2654.2.5.3.1.7.15"),
    //Установленные экстренные индивидуальные вызовы
    COS_INDIV_INITIAL_EMERGENCY_CALL_OID("1.3.6.1.4.1.2654.2.5.3.1.7.7"),

    //================ Общие TAP ================================
    //Интерфейс для RTP
    TAP_RTP_INTERFACE_OID("1.3.6.1.4.1.2654.3.2.15.18.1.1.5.0"),
    //Используемые G711 аудио-каналы
    TAP_BUSY_CHANNEL_G711_OID("1.3.6.1.4.1.2654.3.2.15.17.2.1.5.0"),
    //Используемые ACELP аудио-каналы
    TAP_BUSY_CHANNEL_ACELP_OID("1.3.6.1.4.1.2654.3.2.15.17.2.1.4.0"),
    //Максимальное количество G711 аудио-каналов
    TAP_TOTAL_CHANNEL_G711_OID("1.3.6.1.4.1.2654.3.2.15.17.1.1.7.0"),
    //Максимальное количество ACELP аудио-каналов
    TAP_TOTAL_CHANNEL_ACELP_OID("1.3.6.1.4.1.2654.3.2.15.17.1.1.6.0"),
    //Максимальное количество запросов Availability
    TAP_TOTAL_NUMBERS_AVAILAB_OID("1.3.6.1.4.1.2654.3.2.15.9.1.3.1.0"),
    //Максимальное количество запросов записи разговоров
    TAP_TOTAL_NUMBERS_VOICE_RECORD_OID("1.3.6.1.4.1.2654.3.2.15.9.1.3.3.0"),
    //Максимальное количество запросов записи мониторинга
    TAP_TOTAL_NUMBERS_MONITORING_OID("1.3.6.1.4.1.2654.3.2.15.9.1.3.2.0"),
    //Включена ли функция DGNA
    TAP_FUNCTION_DGNA_OID("1.3.6.1.4.1.2654.3.2.15.12.1.2.5.0"),
    //Включена ли функция Enable/Disable
    TAP_FUNCTION_ENABLE_OID("1.3.6.1.4.1.2654.3.2.15.12.1.2.7.0"),
    //Включена ли функция OOCA
    TAP_FUNCTION_OOCA_OID("1.3.6.1.4.1.2654.3.2.15.12.1.2.4.0"),
    //Включена ли функция групповых отчетов
    TAP_FUNCTION_GROUP_REPORT_OID("1.3.6.1.4.1.2654.3.2.15.12.1.2.6.0"),
    //Включена ли функция записи разговоров
    TAP_FUNCTION_VOICE_RECORDING_OID("1.3.6.1.4.1.2654.3.2.15.12.1.2.8.0"),
    //Включена ли функция мониторинга SDS
    TAP_FUNCTION_MON_SDS_OID("1.3.6.1.4.1.2654.3.2.15.12.1.2.10.0"),
    //Включена ли функция мониторинга вызовов
    TAP_FUNCTION_MON_CC_OID("1.3.6.1.4.1.2654.3.2.15.12.1.2.11.0"),
    //Включена ли функция мониторинга регистраций
    TAP_FUNCTION_MON_MM_OID("1.3.6.1.4.1.2654.3.2.15.12.1.2.9.0"),
    //Включена ли функция перевода вызовов
    TAP_FUNCTION_CALL_FORWARDING_OID("1.3.6.1.4.1.2654.3.2.15.12.1.2.3.0"),
    //Включена ли функция проверки доступности
    TAP_FUNCTION_CHECK_AVAIL_OID("1.3.6.1.4.1.2654.3.2.15.12.1.2.12.0"),
    //Занятые аудио каналы для вызовов
    TAP_BUSY_CHANNEL_CC_OID("1.3.6.1.4.1.2654.2.5.3.1.6.4"),
    //Занятые аудио каналы для мониторинга
    TAP_BUSY_CHANNEL_MON_OID("1.3.6.1.4.1.2654.2.5.3.1.6.6"),
    //Занятые аудио каналы для записи разговоров
    TAP_BUSY_CHANNEL_VRC_OID("1.3.6.1.4.1.2654.2.5.3.1.6.8"),
    //Свободные аудио каналы для вызовов
    TAP_FREE_CHANNEL_CC_OID("1.3.6.1.4.1.2654.2.5.3.1.5.3"),
    //Свободные аудио каналы для мониторинга
    TAP_FREE_CHANNEL_MON_OID("1.3.6.1.4.1.2654.2.5.3.1.5.5"),
    //Свободные аудио каналы для записи разговоров
    TAP_FREE_CHANNEL_VRC_OID("1.3.6.1.4.1.2654.2.5.3.1.5.7");
    //================ Общие SMG ================================


    private String oid;
    TetraOid(String oid) {
        this.oid = oid;
    }

    public String getOid() {
        return oid;
    }

    @Override
    public String toString() {
        return "TetraOid{" +
                "oid='" + oid + '\'' +
                '}';
    }
}
